[
  {
    "title": "Kasa",
    "description": "Location Immobilière",
    "image": "/projectImages/kasaProject1.png",
    "image2": "/projectImages/kasaProject2.png",
    "body": "Pendant mon parcours de formation en tant qu'intégrateur web, j'ai eu l'occasion de travailler sur le projet Kasa, un site de location immobilière développé en React et Sass.\n Mon rôle consistait à intégrer une maquette fournie en y incorporant des animations, m'initiant ainsi au design interactif et à la librairie React.\n Travailler sur ce type de site m'a également permis de comprendre les défis spécifiques liés à ce type de plateforme. Cela inclut la nécessité d'une interface intuitive pour les utilisateurs, la gestion des informations complexes et la mise en valeur visuelle des biens immobiliers.\n En somme, ce projet a été une opportunité d'apprentissage très enrichissante, me dotant de compétences pratiques en intégration web, en design interactif et en utilisation de technologies modernes. Cette expérience a renforcé ma passion pour le développement web tout en élargissant mon éventail de compétences pour des projets futurs.",
    "technologies": ["React", "Sass"],
    "github": "https://github.com/batmah2/Kasa",
    "deployed": "https://kasa-batmah2.vercel.app/",
    "bgcolor": "var(--hl2-color)",
    "id": "1"
  },
  {
    "title": "Sophie Bluel",
    "description": "Portfolio Architecte d'intérieur",
    "image": "/projectImages/sophieBluel1.png",
    "image2": "/projectImages/sophieBluel2.png",
    "technologies": ["JavaScript", "HTML", "CSS"],
    "body": "Le projet d'intégration du site de Sophie Bluel, architecte d'intérieur, a représenté une étape essentielle dans mon apprentissage en développement web. En travaillant sur ce projet, j'ai acquis une compréhension approfondie de la gestion des événements utilisateurs grâce à JavaScript. J'ai également pu manipuler efficacement les éléments du DOM, offrant ainsi une expérience utilisateur fluide et interactive.\n",
    "github": "https://github.com/batmah2/Portfolio-Sophie-Bluel",
    "bgcolor": "var(--hl-color)",
    "id": "2"
  },
  {
    "title": "Nina Carducci",
    "description": "Site de retouche et de photgraphie",
    "image": "/projectImages/ninaCarducci1.png",
    "image2": "/projectImages/ninaCarducci2.png",
    "technologies": ["JavaScript", "jQuery", "Bootstrap", "SEO", "Référencement"],
    "body": "Ce projet consistait à optimiser le référencement du site d'une photographe, l'objectif étant de toucher le plus de potentiel clients et de le rendre plus accessible. Voici un détail du proecessus.\n Analyse complète du site avec Lighthouse pour identifier les zones d'amélioration en termes de performances, d'accessibilité et de SEO.\n  Optimisations apportées en se basant sur les recommandations de Lighthouse, améliorant ainsi la vitesse de chargement, la structure HTML et la visibilité du contenu.\n  Intégration de données locales et de balisages structurés pour améliorer le référencement local et enrichir l'apparence dans les résultats de recherche.\n  Évaluation et correction des problèmes d'accessibilité pour garantir une meilleure expérience utilisateur pour tous.",
    "github": "https://github.com/batmah2/Ismail_Mahmoud_SEO_102023",
    "deployed": "https://batmah2.github.io/Ismail_Mahmoud_SEO_102023/",
    "bgcolor": "#6c4bf4",
    "id": "3"
  },
  {
    "title": "724 Events",
    "description": "Agence évènementielle",
    "image": "/projectImages/77events1.png",
    "image2": "/projectImages/77events2.png",
    "technologies": ["React", "Testing"],
    "body": "La simulation de collaboration avec l'agence événementielle 724events m'a offert une précieuse opportunité de reprendre et de finaliser l'intégration d'un site vitrine existant.\n Mon intervention a consisté à identifier et résoudre les problèmes grâce à une approche axée sur les tests unitaires. La mise en place d'un processus de débogage structuré a été un élément clé pour assurer le bon fonctionnement du site.\n En plus des tests unitaires, j'ai élaboré un cahier de recette détaillé contenant différents scénarios de test fonctionnels, illustrant ainsi la méthodologie rigoureuse utilisée pour garantir le bon fonctionnement et la qualité du site.\n En résumé, cette mission m'a permis de mettre en pratique mes compétences en reprise de projet, en résolution de bugs et en tests, tout en démontrant ma capacité à assurer la qualité et la fiabilité d'un site web.",
    "github": "https://github.com/batmah2/77-Events",
    "bgcolor": "#f85781",
    "id": "4"
  }
]
