[
  {
    "title": "Kasa",
    "description": "Location Immobilière",
    "image": "/projectImages/kasaProject1.png",
    "image2": "/projectImages/kasaProject2.png",
    "body": "Pendant mon parcours de formation en tant qu'intégrateur web, j'ai eu l'occasion de travailler sur le projet Kasa, un site de location immobilière développé en React et Sass.\n Mon rôle consistait à intégrer une maquette fournie en y incorporant des animations, m'initiant ainsi au design interactif et à la librairie React.",
    "technologies": ["React", "Sass"],
    "github": "https://github.com/batmah2/Kasa",
    "deployed": "https://kasa-batmah2.vercel.app/",
    "bgcolor": "var(--hl2-color)",
    "id": "1"
  },
  {
    "title": "Sophie Bluel",
    "description": "Portfolio Architecte d'intérieur",
    "image": "/projectImages/sophieBluel1.png",
    "image2": "/projectImages/sophieBluel2.png",
    "technologies": ["JavaScript", "HTML", "CSS"],
    "body": "Le projet d'intégration du site de Sophie Bluel, architecte d'intérieur, a représenté une étape essentielle dans mon apprentissage en développement web. En travaillant sur ce projet, j'ai acquis une compréhension approfondie de la gestion des événements utilisateurs grâce à JavaScript. J'ai également pu manipuler efficacement les éléments du DOM, offrant ainsi une expérience utilisateur fluide et interactive.\n",
    "github": "https://github.com/batmah2/Portfolio-Sophie-Bluel",
    "bgcolor": "var(--hl-color)",
    "id": "2"
  },
  {
    "title": "Nina Carducci",
    "description": "Site de retouche et de photgraphie",
    "image": "/projectImages/ninaCarducci1.png",
    "image2": "/projectImages/ninaCarducci2.png",
    "technologies": ["JavaScript", "jQuery", "Bootstrap", "SEO", "Référencement"],
    "body": "Ce projet m'a permis d'approfondir mes connaissances dans l'optimisation de site internet, du référencement pour toucher un maximum de potentiel clients à l'optimisation de performance et de temps de chargements",
    "github": "https://github.com/batmah2/Ismail_Mahmoud_SEO_102023",
    "deployed": "https://batmah2.github.io/Ismail_Mahmoud_SEO_102023/",
    "bgcolor": "#6c4bf4",
    "id": "3"
  },
  {
    "title": "724 Events",
    "description": "Agence évènementielle",
    "image": "/projectImages/77events1.png",
    "image2": "/projectImages/77events2.png",
    "technologies": ["React", "Testing"],
    "body": "This application tests JavaScript knowledge through a timed, question-based quiz. Users are presented with 5 random questions and have 50 seconds to complete the quiz. The remaining time at completion determines the final score, rewarding both accuracy and speed.\nTo add challenge, the timer is reduced by 10 seconds for each incorrect answer. This creates urgency to answer carefully within the time limit. Questions are drawn randomly from a pool to ensure variety upon each attempt.\nBuilt using JavaScript, this project provides hands-on experience creating a responsive quiz application. Key learning outcomes include: \n➤ Generating random questions from a pool of options\n➤ Implementing a countdown timer with penalty deductions\n➤ Calculating scores based on time remaining\n➤ Providing interactive quiz feedback to users\nOverall, this application allows users to test their JavaScript skills through an engaging, time-pressured quiz interface. Both code knowledge and quick thinking are required to achieve a top score.",
    "github": "https://github.com/batmah2/77-Events",
    "deployed": "https://77-events.vercel.app/",
    "bgcolor": "#f85781",
    "id": "4"
  }  
]
